# Kлассная работа
# Формальное приветствие
def great():
    name = input()
    lastname = input()
    print(f"Здравствуйте, {name} {lastname}.")


great()


# Пробелы
def space_game(text):
    c = 0
    for i in text:
        if i == " ":
            c += 1
    if c % 2 == 0:
        print("Вы выиграли")
    else:
        print("Вы проиграли")


space_game(input())

# Какая четверть?

# Привет, как тебя там?

# Треугольник?

# Среднее значение

# Статистики

# Домашняя работа
# Улыбайтесь, господа!

# Скажи «пароль» и проходи

# Золотое сечение

# Дополнительные задачи
# Правильная скобочная последовательность

# Уравнение прямой

# Таблица квадратов чисел

# Точка на прямой

# Крестики-нолики

# Решето Эратосфена

# Длинношеее
